package com.science.app.sciencelab;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.content.SharedPreferences;
import android.os.Bundle;
import android.view.animation.Animation;
import android.view.animation.AnimationUtils;
import android.widget.ImageView;
import android.widget.TextView;
import android.widget.Toast;

public class SplashScreen extends AppCompatActivity {
    MyDbHelper myDbHelper;
    ImageView logoIm;
    TextView appNameTv;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_splash_screen);
        SharedPreferences prefs = getSharedPreferences("science", MODE_PRIVATE);
        boolean isFirst = prefs.getBoolean("isFirstTime", true);
        if (isFirst) {

            myDbHelper   = new MyDbHelper(SplashScreen.this);

            myDbHelper.addItem("الباروميتر المعدني",
                    "عبارة عن علبة معدنية مستديرة من النيكل والفضة مفرغة تماما من الهواء فإذا زاد الضغط يضغط على السطح المموج للعلبة المفرغة فتنخفض سطح العلبة وينخفض معه الساق والرافعة فيتحرك المحور والمؤشر المتصل به حركة دائرية أمام الدائرة المدرجة ليعطى قيمة الضغط, وإذا قل الضغط يرتفع سطح العلبة فيرتفع معه الساق والرافعة فيتحرك المحور والمؤشر حركة دائرية فى عكس الاتجاه السابق.\n" +
                            "- وظيفته الرئيسية  تسجيل الضغط الجوي عند مستوى \n" +
                            "البحر.\n",
                    R.drawable.photo1, 1);
            myDbHelper.addItem("الباروميتر الزئبقي",
                    "يتكون من أنبوب زجاجي من الزئبق له مستودع عند القاع، وتسبب التغيرات في ضغط الهواء ارتفاع أو انخفاض الزئبق في الأنبوب. \n" +
                            "ولكي نحصل على قراءة دقيقة يتعين تعديل المقياس حيث تكون نقطة الصفر في مستوى سطح الزئبق نفسه الموجود في المستودع، وهذا التعديل ضروري لأن هذا السطح يرتفع حينما ينخفض الزئبق \n" +
                            "في الأنبوب، وينخفض عندما يرتفع الزئبق في الأنبوب."
                    , R.drawable.photo2, 1);
            myDbHelper.addItem("جهاز هوك",
                    "مكونات الجهاز : القاعدة  – الحامل –  مرآة مدرجة –  نابض –  مجموعة أوزان مع خطاف.\n" +
                            "استخدامات الجهاز : يستخدم هذا الجهاز في تجربة إثبات قانون هوك وحساب ثابت المرونة لنابض حلزوني.\n"

                    , R.drawable.photo3, 1);
            myDbHelper.addItem("ميزان ذو كفتين",
                    "يتألف الميزان الميكانيكي مبدئياً من عاتق (عارضة) صلب يتأرجح على شفرة أفقية كحد السكين عند مركزه تدعى نقطة الارتكاز ، وعلى طرفي العاتق وعلى مسافة متساوية من المركز توجد شفرتان متوازيتان وكفتان تتدليان من حاملين، أو ترتكزان عليهما. يُوضع على إحداهما الكتلة المراد روزها، وعلى الثانية ثقل معلوم. \n" +
                            "مبدأ عمل الميزان :إن أسهل طريقة لاستعمال الميزان هي الوزن المباشر،فعند وضع كتلة ما (عينة) مجهولة الوزن في إحدى الكفتين يميل العاتق بزاوية معينة تتناسب مع وزن الكتلة.\n"
                    , R.drawable.photo4, 1);
            myDbHelper.addItem("الميكروميتر",
                    "هو عبارة عن جهاز مصمم لقياس البعد بين نقطتين للعديد من الأسطح ذات الأبعاد والأشكال المختلفة (كالطول والعرض والسمك والقطر والعمق) والتى تتطلب دقة عالية في القياس .\n" +
                            "يتكون جهاز ميكرومتر القياس الخارجي من جزئين أساسين:\n" +
                            "الجزء الثابت : ويحتوي على إطار أو هيكل الجهاز (Frame )على شكل حرف ((U لحمل بقية مكونات الجهاز الثابتة والمتحركة منها.\n" +
                            "الجزء المتحرك : الجزء الأساسي المتحرك هو جلبة القياس Sleeve) )التي إذا قمنا بتحريكها حركة دورانية عن طريق المسمار الجاس Ratchet Knob) ) فيتحرك عمود القياس لتثبيت الشيء المراد قياسه.\n"
                    , R.drawable.photo5, 1);
            myDbHelper.addItem("القدمة ذات الورنية",
                    "و هي أداة قياس تستعمل لقياس البعد (السُمك ) بين سطحين متوازيين، و قطر الاسطوانات ذات القطر الصغير)، كما تقيس أيضأ القطر الداخلي للاسطوانات، و عمق الثقوب و هي دقيقة جدًا\n" +
                            "\n" +
                            "-الورنيّة هي مقياس إضافي متحرك يلحق بمسطرة \n" +
                            "بمقياس ثابت ليتيح قراءة المسافة  بطريقة أكثر \n" +
                            "دقة عن طريق الحصول على كسور وحدات \n" +
                            "المقياس الثابت.\n" +
                            "\n"
                    , R.drawable.photo6, 1);
            myDbHelper.addItem("الميزان النابضي",
                    "يقاس وزن الجسم باستخدام أداة تسمى الميزان النابضي.\n" +
                            "يتكون الميزان النابضي من نابضٍ متصلٍ بمؤشر، وفي نهاية النابض خطّاف يُعلّق به الجسم المُراد وزنه.\n" +
                            "وبزيادة وزن الجسم المعلّق بالخطاف، \n" +
                            "زادت استطالة النابض.\n" +
                            "- يقاس الوزن بوحدة نيوتن .\n" +
                            "\n"
                    , R.drawable.photo7, 1);
            myDbHelper.addItem("طاولة القوى",
                    "تتكون هذه المجموعة بشكل أساسي من قرص معدني دائري الشكل مدرج من مركزه بزوايا من (صفر – °360 ) مثبت على حامل يرتكز على قاعدة معدنية ، يزود مع هذا الجهاز مجموعة من البكرات والخيوط والحلقات المعدنية ومجموعة من الأوزان المتغيرة القابلة للتعليق (Slotted masses).\n" +
                            "التجارب التي يمكن تنفيذها باستخدام هذا الجهاز :\n" +
                            "1. إيجاد محصلة قوتين مستويتين متلاقيتين .\n" +
                            "2. إيجاد محصلة ثلاث قوى مستوية ومتلاقية .\n" +
                            "3. تطبيق قاعدة الجيوب ( قاعدة لامي).\n" +
                            "4. تحليل قوة في اتجاهين متعامدين.\n" +
                            " \n" +
                            "\n"
                    , R.drawable.photo8, 1);
            myDbHelper.addItem("السكة الهوائية",
                    "مبدأ عمل السكة الهوائية:\n" +
                            "تعتمد السكة الهوائية في عملها على مبدأ الوسادة الهوائية لدراسة حركة الأجسام بمعزل عن قوة الاحتكاك.\n" +
                            "الأجزاء التي تتكون منها مجموعة السكة الهوائية:\n" +
                            "1. المجرى الهوائي .\n" +
                            "2.المضخة .\n" +
                            "3.العداد الزمني .\n" +
                            "4. البوابات الكهروضوئية .\n" +
                            "5. العربات .\n" +
                            "6. مجموعة الكتل .\n" +
                            "7 .الحلقات المرنة .\n" +
                            "8. النوابض .\n" +
                            "9.اللاصق التشابكي.\n" +
                            "10.الأقراص البلاستيكية .\n" +
                            "11. براغي التثبيت .\n" +
                            "12. براغي ضبط الاستواء .\n" +
                            "13. البكرات .\n" +
                            "14. الحواجز الضوئية .\n" +
                            "مجالات استخدام السكة الهوائية:\n" +
                            "1.تطبيق قانون نيوتن الأول .\n" +
                            "2.دراسة السرعة المتوسطة والسرعة اللحظية.\n" +
                            "3. حساب التسارع لجسم يتحرك على سط مائل .\n" +
                            "4.تطبيق قانون نيوتن الثاني .\n" +
                            "5. تطبيق قانون نيوتن الثالث .\n" +
                            "6. دراسة قانون حفظ الطاقة الميكانيكية .\n" +
                            "7. تطبيق تجارب التصادم المرن وعديم المرونة.\n" +
                            "8. دراسة الحركة التوافقية البسيطة .\n" +
                            "\n" +
                            "\n" +
                            "\n"
                    , R.drawable.photo9, 1);
            myDbHelper.addItem("جهاز السقوط الحر",
                    "جهاز السقوط الحر يستخدم في إثبات قوانين نيوتن ،ويتكون من: \n" +
                            " - مسطرة مدرّجة.\n" +
                            " - حامل للكرة المعدنية.\n" +
                            "- ساعة إيقاف كهربائية.\n" +
                            "تثبت الكرة المعدنية في الحامل بالمسمار الضاغط عند الإرتفاع المطلوب \n" +
                            "وبذلك تكون الدائرة الكهربائية متصلة من خلال الكرة المعدنية \n" +
                            "عندما تُفلت الكرة تنفصل الدائرة الكهربائية ويبدأ المؤقت بالعد. \n" +
                            "وعندما تهبط الكرة على الكفة تضغطها للأسفل\n" +
                            "فتتصل الدائرة الكهربائية مرة أخرى ويتوقف العد.\n"
                    , R.drawable.photo10, 1);
            myDbHelper.addItem("الأواني المستطرقة",
                    "هي أداة اختبارية توضح أن ضغط السائل عند قاع الإناء لا يعتمد على شكل أو حجم الإناء و إنما يعتمد على ارتفاع السائل في الإناء .\n" +
                            "جهاز الأواني المستطرقة هو مجموعة من الأواني مختلفة الشكل إلا إن ارتفاع السائل فيها متساوي وهذا يعني أن الضغط فيها متساوي.\n"
                    , R.drawable.photo11, 1);
            myDbHelper.addItem("مخلخلة الهواء",
                    "جهاز يقوم بتفريغ الهواء في التجارب العلمية، وهناك نوعان من الأجهزة: ميكانيكي وكهربائي.          ويتكون الجهاز من عدة أجزاء رئيسية : \n" +
                            " صمام سحب الهواء، قصبة التفريغ، ذراع المفرغة، مقبض الذراع ، القاعدة والمحرك .\n" +
                            "استخدامات الجهاز:\n" +
                            "   يستخدم في التجارب العملية مثل تجارب الصوت وتجارب الغليان.\n"
                    , R.drawable.photo12, 1);

            prefs.edit().putBoolean("isFirstTime", false).apply();

            myDbHelper.addItem("راسم الذبذبات",
                    "- تعريفه :هو جهاز يستخدم لتعيين تردد جهد مجهول و لدراسة التغيرات للتيارات الكهربائية والجهود والنبضات الكهربائية.\n" +
                            " - تركيبه : يتركب من أنبوبه أشعة الكاثود ( المجموعة الحارفة ) فيها عبارة عن زوجين من الألواح المعدنية    (س1, س2,ص1,ص2 ) يولدان مجالين كهربائيين متعامدين على بعضهما البعض وعلى مسار الشعاع الالكتروني \n" +
                            " - استخداماته: 1ـ يستخدم في الكشف عن تردد مجهول بمعلومية تردد جهد معلوم.\n" +
                            "2ـ دراسة خصائص التيارات المترددة .\n"
                    ,R.drawable.photo2_1,2);
            myDbHelper.addItem("وحدة جهد مستمر ومتردد",
                    "جهاز يقوم بتوفير جهد مستمر ومتردد منخفض الجهد يتراوح بين 0 و 30 فولت، ويتكون من: \n" +
                            "مفتاح التشغيل، مفتاح التحكم في الجهد، مخارج الجهد، برغي تصفير الجهاز، مفتاح اختيار الجهد المستمر أو المتردد ومفتاح إعادة التشغيل.\n" +
                            "استخدامات الجهاز:\n" +
                            "يستخدم في التجارب العملية لإمداد الدوائر الكهربائية والمغناطيسية والإلكترونية بالجهد الكهربائي المنخفض.\n"
                    ,R.drawable.photo2_2,2);
            myDbHelper.addItem("وحدة جهد عالي الفولتية",
                    "جهاز يقوم بتوفير جهد مستمر عالي الجهد (الفولتية ) يتراوح بين 0 و 6 آلاف فولت مع شدة تيار منخفضة (مللي أمبير) كما يحتوي على وحدة جهد متردد ثابت الفولتية (3-6)فولت.\n" +
                            " ويتكون من: مفتاح التشغيل، مفتاح التحكم في الجهد، مخارج الجهد، برغي ( مسمار) تصفير الجهاز، مفتاح اختيار الجهد المستمر ومفتاح إعادة التشغيل.\n" +
                            "استخدامات الجهاز:\n" +
                            " يُستخدم في التجارب العملية لإمداد الدوائر الكهربائية والمغناطيسية والإلكترونية بالجهد الكهربائي.\n"
                    ,R.drawable.photo2_3,2);
            myDbHelper.addItem("ملف رومكوف",
                    "يتكون الجهاز بصورة أساسية من ملفين:\n" +
                            "الملف الأول يتكون من سلك نحاسي معزول غليظ يتراوح عدد لفاته بين 150و300لفة تقريبا .\n" +
                            "الملف الثانوي يتكون من سلك نحاسي رفيع معزول يتراوح عدد لفاته من40000الى100000لفة تقريبا .\n" +
                            "يستخدم الملف لتوليد شحنة تفريغ عالية الجهد قادرة على تأيين الغازات مخلخلة الضغط  في أنابيب التفريغ (أجهزة أشعة المهبط).\n" +
                            "وكذلك يستخدم في تمرير شرارة كهربائية في أجهزة الاحتراق الداخلي.\n"
                    ,R.drawable.photo2_4,2);
            myDbHelper.addItem("ساعة القياس الرقمية",
                    "جمع هذا الجهاز بين أكثر الأجهزة أهمية (الأميتر، الأفوميتر, الأوميتر  )ويحتوي هذا الجهاز على مفتاح اختيار يمكنك من خلاله اختيار نوع الكمية  المراد قياسها والتدريج المناسب.\n" +
                            "يقيس جهاز الملتيميتر:\n" +
                            "الأمبير ِA        .الفولت V           .الأوم          والأجهزة الحديثة منها تقيس المكثفات والترانزستور .\n" +
                            "وظيفة وطريقة عمله : تستخدم مثل هذا النوع من الأجهزة  الشائعة في أعمال الصيانة والإصلاح حيث يمكن بنفس الجهاز قياس فرق الجهد  وشدة التيار بمدى \n" +
                            "قياسات مختلفة .\n"
                    ,R.drawable.photo2_5,2);
            myDbHelper.addItem("جهاز قياس فرق الجهد الفولتميتر",
                    "يستخدم هذا الجهاز لقياس فرق الجهد المطبق بين طرفي حمل كهربائي ما أو لقياس جهد المصدر يوصل هذا الجهاز على التوازي مع المصدر أو الحمل  الكهربائي مع شرط سريان التيار الكهربائي أي يجب أن تكون الدارة الكهربائية  المراد قياس فولتيتها مغلقة، ويحتوي هذا الجهاز على مفتاح اختيار لتحديد  نوع الجهد المراد قياسه هل هو متردد ام ثابت.\n"
                    ,R.drawable.photo2_6,2);
            myDbHelper.addItem("الأميتر",
                    "يستخدم هذا الجهاز لقياس التيار الكهربائي المار في حمل كهربائي ما ،  يوصل هذا الجهاز مع الحمل المراد قياس تياره على التوالي مع مراعاة أن تكون  الدارة الكهربائية مغلقة، ويحتوي هذا الجهاز على مفتاح اختيار لتحديد نوع  التيار المراد قياسه هل هو متردد أم ثابت.\n"
                    ,R.drawable.photo2_7,2);
            myDbHelper.addItem("الجلفانوميتر",
                    "جهاز حساس يستخدم  لقياس شدة التيار الصغيرة جداً في الدارات الكهربائية.\n"
                    ,R.drawable.photo2_8,2);
            myDbHelper.addItem("الملف الكهربائي",
                    "هو سلك ملفوف حلزونيا ذو عدد لفات كبير بحيث تشكل شكلا أسطوانيا. يستخدم في الفيزياء وفي الهندسة الكهربائية ويكون عادة ملفوفا حول أسطوانة (أو قلب) حديدية. \n" +
                            "عندما يمر تيار كهربائي في الملف ينشأ مجالا مغناطيسيا داخل الملف اللولبي وخارجه.\n"
                    ,R.drawable.photo2_9,2);
            myDbHelper.addItem("المقاومات المنغيرة",
                    "تستخدم المقاومات المتغيرة في تجزئة الجهد في الدوائر الكهربائية ،وتصنع المقاومة المتغيرة لتحمل تيارات عالية عن طريق المقاومة السلكية ، أو تيارات منخفضة المقاومة مثل المقاومات الكربونية."
                    ,R.drawable.photo2_10,2);
            myDbHelper.addItem("الوصلة الثنائية (الدايود)",
                    "تصنع الوصلة الثنائية (الدايود) من السيليكون أو الجرمانيوم وهو عبارة عن وصلة مكونة من طبقتين مختلفتين من المادة شبه الموصلة إحداهما مادة شبه موصلة من النوع الموجبP)  ) والأخرى مادة شبه موصلة من النوع السالب (N) .\n" +
                            "تستخدم الوصلات الثنائية في الدوائر الإلكترونية بكثرة، ومن استخداماتها تقويم التيار الكهربائي المتردد لتحويله إلى تيار مستمر ."
                    ,R.drawable.photo2_11,2);

            myDbHelper.addItem("الكشاف الكهربائي",
                    " هو جهاز يستخدم لدراسة الكهرباء الساكنة ، والكشف عن الشحنات الموجودة على الجسم ونوعها وأبسط أنواع الكشافات الكهربائية هو الكشاف الكهربائي ذو الورقة الذهبية.\n" +
                            "تركيبه :  قرص مصنوع من عنصر فلزي ـ ساق فلزية ـ ورقتان فلزيتان رقيقتان ـ سداد ـ وعاء زجاجي أو من فلز وله وجهان من الزجاج .\n" +
                            "يمكن شحن الكشاف الكهربائي بعدة طرق ،\n" +
                            " منها طريقة اللمس .\n"
                    ,R.drawable.photo3_1,3);
            myDbHelper.addItem("مولد فاندي غراف",
                    "أسماء أخرى: مولد الكهرباء الساكنة ،فان دي غراف هو عبارة عن مُولد كهربائي يقوم بتوليد الكهرباء الساكنة.\n" +
                            "طريقة عمل الجهاز :\n" +
                            "يقوم جهاز فاني دي غراف بتوليد جهد كهربائي  عالي جدًّا علما أن تأثير هذا الجهاز يكون بسيط جدا قد لا يتعدى (لسعة بسيطة) لأن التيار  الكهربائي المتولد يكون معدوم.\n" +
                            "و يتكون الجهاز من كرة (قُبة) معدنية مجوفة محمولة على قضيبين عازلين و حزام عازل من الحرير أو المطاط تدور بكرتين متباعدتين إحداهما في الأسفل تديرها محرك كهربائي والأخرى في الأعلى تدور بتأثير الحزام و يمر الحزام أثناء دورانه بقطبين أحدهما في الأعلى و الآخر في الأسفل وهما عبارة عن مشطين كل واحد منهما ذو أسنان مدببة باتجاه الحزام حيث تعمل البطارية على تجهيز القطب الأسفل بفرق جهد\n" +
                            " (10000)فولت بالمقارنة مع الأرض فيقوم المجال الكهربائي العالي المتكون حول أسنان القطب الأسفل بتأيين الهواء القريب منها ثم تتكون شحنات موجبة تسحب بواسطة الحزام الذي يحملها إلى داخل الكرة المعدنية.\n"
                    ,R.drawable.photo3_2,3);

            myDbHelper.addItem("البوصلة",
                    "من أبسط الأدوات المعملية المستخدمة في تجارب المغناطيسية وتتركب من إبرة مغناطيسية صغيرة معينة الشكل محمولة على سن عمودي مدبب وموضوعة داخل علبة بلاستيكية ذات وجه زجاجي, وتسمى بوصلة الجيب , أما البوصلة البحرية فهي أكبر وغالباُ توضع داخل صندوق خشبي. \n" +
                            "تستخدم البوصلة في تجارب المجال المغناطيسي \n" +
                            "وتحديد الاتجاهات.\n"
                    ,R.drawable.photo4_1,4);
            myDbHelper.addItem("المغانط",
                    "تكون على أشكال متنوعة منها المستطيل ومنها الإسطواني ومنها على شكل حذوة الفرس والغرض منها التجارب المغناطيسية .\n"
                    ,R.drawable.photo4_2,4);
            myDbHelper.addItem("إبرة الميل",
                    "عبارة عن إبرة مغناطيسية حرة الحركة مركبة على منقلة مدرجة والغرض منها قياس زاوية الانحراف.\n"
                    ,R.drawable.photo4_3,4);

            myDbHelper.addItem("المسعر الحراري",
                    "جهاز يستخدم لتقدير وقياس كمية الحرارة المصاحبة للتفاعل الكيميائي باستـخدام جهـاز المسعر الحراري (الكالورميتر calorimeter ) .\n" +
                            "يتكوّن من صندوق معزول مملوء بالماء ويوضع به وعاء التفاعل بالإضافة إلى ترمومتر ومحرك وتتلخص الفكرة التي يعتمد عليها عمل المسعر ببساطة في أن التغير في درجة حرارة كتلة معينة من الماء تعتمد على كمية الحرارة المضافة إليها أو المأخوذة منها.\n"

                    ,R.drawable.photo5_1,5);
            myDbHelper.addItem("مقياس الرطوبة (هيجروميتر)",
                    "مقياس الرطوبة\n" +
                            "يتكون من تيرمومترين أحدهما يبلل مستودعه \n" +
                            "بالماء.\n" +
                            "والفرق بين قراءة التيرمومترين عبارة عن \n" +
                            "نسبة الرطوبة في الجو.\n" +
                            "\n"
                    ,R.drawable.photo5_2,5);
            myDbHelper.addItem("التيرموميتر الزئبقي",
                    "يتألف من انتفاخ يحوي كمية من الزئبق السائل الذي يمكنه التمدد والتحرك خلال أنبوبة شعرية وحجم الانبوبة الشعرية أقل بكثير من حجم الانتفاخ بحيث يؤدي تمدد بسيط للزئبق إلى حركة كبيرة للخيط الزئبقي . وحول هذه الانبوبة الشعرية يوجد أنبوب زجاجي مدرج ، وأحد تداريج درجات الحرارة شائعة الاستعمال هو التدرج المئوي ( السليسيوسي ) الذي يتم الحصول عليه بوضع الترمومتر في ثلج ينصهر وحفر علامة ( صفر مئوي) عند النقطة التي يقف عندها الخيط الزئبقي ثم يوضع في ماء يغلي حيث يتحرك الزئبق إلى موضع جديد تحفر عنده الدرجة (100) درجة مئوي، ثم تقسم المسافة بين هاتين النقطتين إلى (100) جزء متساوي .\n" +
                            "\n"
                    ,R.drawable.photo5_3,5);
            myDbHelper.addItem("جهاز هوب",
                    "جهاز يستخدم لدراسة شذوذ الماء يتكون من:\n" +
                            "إناء اسطواني .\n" +
                            "حوض خارجي .\n" +
                            "فتحتان جانبيتان لميزان الحرارة.\n"
                    ,R.drawable.photo5_4,5);
            myDbHelper.addItem("ثنائي الفلز",
                    "ثنائي المعدن بالإنجليزية: Bi-metal) ) هو عبارة عن معدنين مختلفين متصلين ببعضهما البعض على شكل طبقتين. وهو خلاف السبيكة التي يتم فيها خلط المعادن المختلفة ببعضها. \n" +
                            "تستخدم فكرة ثنائي المعدن في استغلال التغير في درجات الحرارة لتحويلها إلى حركة ميكانيكية. حيث أن المعدنين المختلفين يكون لهما معامل تمدد حراري مختلف، عند ارتفاع درجة الحرارة يبدأ المعدن ذو معامل التمدد الحراري الأقل في التمدد ولكن نطاق تمدده محدود لارتباطه بالمعدن ذي معامل التمدد الحراري الأعلى فيبدأ بالانحناء، وعند عودة درجة الحرارة إلى الوضع الطبيعي يعود إلى وضعه الأصلي.\n"
                    ,R.drawable.photo5_5,5);
            myDbHelper.addItem("جهاز اختلاف توصٌيل المعادن للحرارة",
                    "لهذا الجهاز أشكال مختلفة ،إلا أنها تؤدي الغرض نفسه، كما تشترك جميعها في الأجزاء الرئيسية، وأهمها القضبان المعدنية.\n" +
                            "استخدامات الجهاز:\n" +
                            "يستخدم الجهاز لإثبات أن المواد المختلفة تتفاوت في ناقليتها \n" +
                            "     وتوصيلها للحرارة.\n"
                    ,R.drawable.photo5_6,5);

            myDbHelper.addItem("المجموعة الضوئية – قرص هارتل",
                            "المكونات: تتكون المجموعة من :\n" +
                            " 1- لوح معدني مستطيل يثبت بشكل قائم بواسطة حامل معدني وقاعدة .\n" +
                            "2- قرص معدني مدرج قابل للدوران حول محور يمكن تثبيته على لوح العرض \n" +
                            "المستطيل أو إزالته حسب التجربة المراد تنفيذها .\n" +
                            "3- مصدر ضوئي يعمل على جهد منخفض 6-12 فولت .\n" +
                            "4- مجموعة من الحواجز الضوئية مزودة بشقوق للحصول على حزم ضوئية\n" +
                            " لتمثيل الشعاع الضوئي ،كما يحتوي على مرشحات بألوان مختلفة للحصول \n" +
                            "على حزم ضوئية ملونة .\n" +
                            "5- مجموعة من العناصر الضوئية تتضمن مقاطع لعدسات لامة ومفرقة \n" +
                            "للأشعة (محدبة ومقعرة) ومجموعة من المناشير المختلفة الأشكال لدراسة انكسار الاشعة فيها إضافة الى مرايا مستوية ومقعرة ومحدبة وكل هذه العناصر الضوئية يمكن تثبيتها على اللوح المستطيل القائم بواسطة مغانط صغيرة مثبتة فيها \n" +
                            "6- تحتاج هذه المجموعة الى مصدر جهد منخفض لا يكون عادة ضمن المجموعة .\n" +
                            "استخدامات المجموعة : يمكن باستخدام هذه المجموعة تنفيذ معظم التجارب المتعلقة بالضوء الهندسي (Geometrical Optics) من حيث الانعكاس والانكسار والتداخل والحيود .\n"
                    ,R.drawable.photo6_1,6);
            myDbHelper.addItem("العدسات المحدبة والمقعرة",
                    ""
                    ,R.drawable.photo6_2,6);
            myDbHelper.addItem("المرشح الضوئي","",R.drawable.photo6_3,6);
            myDbHelper.addItem("حوض الأمواج","",R.drawable.photo6_4,6);


            myDbHelper.addItem("الميزان الإلكتروني","",R.drawable.photo7_1,7);
            myDbHelper.addItem("خزانة طرد الغازات","",R.drawable.photo7_2,7);
            myDbHelper.addItem("هيدروميتر كثافة","",R.drawable.photo7_3,7);
            myDbHelper.addItem("مقياس الأس الهيدروجيني","",R.drawable.photo7_4,7);
            myDbHelper.addItem("جهاز هوفمان","",R.drawable.photo7_5,7);
            myDbHelper.addItem("المكثف","",R.drawable.photo7_6,7);
            myDbHelper.addItem("قمع بوخنر","",R.drawable.photo7_7,7);
            myDbHelper.addItem("قنطرة ملحيٌة","",R.drawable.photo7_8,7);
            myDbHelper.addItem("أنابيب الطيف","",R.drawable.photo7_9,7);
            myDbHelper.addItem("جهاز كب","",R.drawable.photo7_10,7);

            myDbHelper.addItem("جهاز الطرد المركزي","",R.drawable.photo8_1,8);
            myDbHelper.addItem("الشريحة المجهرية","",R.drawable.photo8_2,8);
            myDbHelper.addItem("طبق بتري","",R.drawable.photo8_3,8);
            myDbHelper.addItem("المجهر الضوئي","",R.drawable.photo8_4,8);
            myDbHelper.addItem("المجهر التشرٌيحًي","",R.drawable.photo8_5,8);

            myDbHelper.addItem("الماصة","",R.drawable.photo9_1,9);
            myDbHelper.addItem("الدورق القياسي","",R.drawable.photo9_2,9);
            myDbHelper.addItem("السحاحة","",R.drawable.photo9_3,9);
            myDbHelper.addItem("الدورق","",R.drawable.photo9_4,9);
            myDbHelper.addItem("المخبار المدرج","",R.drawable.photo9_5,9);
            myDbHelper.addItem("كأس زجاجًي","",R.drawable.photo9_6,9);
            myDbHelper.addItem("المعوجة الزجاجٌية","",R.drawable.photo9_7,9);
            myDbHelper.addItem("زجاجة ساعة","",R.drawable.photo9_8,9);
            myDbHelper.addItem("أنبوب اختبار","",R.drawable.photo9_9,9);
            myDbHelper.addItem("الأقماع الزجاجٌية","",R.drawable.photo9_10,9);

            //myDbHelper.addItem("أدوات مساعدة","",R.drawable.ic_electr,10);
            myDbHelper.addItem("ثاقب الفلين","",R.drawable.photo10_1,10);
            myDbHelper.addItem(" لهب بنسن","",R.drawable.photo10_2,10);
            myDbHelper.addItem("ورق الترشيح","",R.drawable.photo10_3,10);
            myDbHelper.addItem("سباتيولا_ ملعقة الاحتراق","",R.drawable.photo10_4,10);
            myDbHelper.addItem("قارورة بلاستيكية","",R.drawable.photo10_5,10);
            myDbHelper.addItem("ماسك","",R.drawable.photo10_6,10);
            myDbHelper.addItem("البوتقة","",R.drawable.photo10_7,10);


        }

       /* logoIm = findViewById(R.id.logoIm);
        Animation animationTop = AnimationUtils.loadAnimation(SplashScreen.this,R.anim.fromtop);
        logoIm.setAnimation(animationTop);

        appNameTv = findViewById(R.id.appNameTv);
        Animation animationBottom = AnimationUtils.loadAnimation(SplashScreen.this,R.anim.frombottom);
        appNameTv.setAnimation(animationBottom);*/


        new Thread(new Runnable() {
            @Override
            public void run() {
                try {
                    Thread.sleep(3000);
                    Intent intent = new Intent(SplashScreen.this, MainActivity.class);
                    startActivity(intent);
                } catch (InterruptedException e) {
                    e.printStackTrace();
                }
            }
        }).start();

    }


}
